# Oscar Dominguez
<img src='Data/Books.png'>

In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

## Change username and password to match your personal MySQL Server settings
username = 'root' # default username for MySQL db is root
password = 'password1' # whatever password you chose during MySQL installation.

connection_str = f'mysql+pymysql://{username}:{password}@localhost/books'
engine = create_engine(connection_str)

In [2]:
#Creating database
create_database(connection_str)

In [3]:
#Checking that database created exists
database_exists(connection_str)

True

# Authors table

In [4]:
import pandas as pd
authors = pd.read_csv('data/Authors.csv')
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

## Adding Authors table to MySQL database

In [5]:
authors.to_sql('Authors', engine, if_exists = 'replace')

5

In [6]:
q = """SELECT * FROM Authors LIMIT 5;"""
pd.read_sql(q, engine)

   index  id        author_name
0      0   1       Stephen King
1      1   2  F.Scott Fitgerald
2      2   3        Jack London
3      3   4        Jane Austen
4      4   5       Mary Shelley

# Users table

In [7]:
users = pd.read_csv('data/Users.csv')
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

## Adding Users table to MySQL database

In [8]:
users.to_sql('Users', engine, if_exists = 'replace')

3

In [9]:
q = """SELECT * FROM Users LIMIT 5;"""
pd.read_sql(q, engine)

   index  id first_name  last_name                 email
0      0   1       John        Doe          JD@books.com
1      1   2      Robin      Smith       Robin@books.com
2      2   3     Gloria  Rodriguez  grodriquez@books.com

# Books table

In [10]:
books = pd.read_csv('data/Books.csv')
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

## Adding Books table to MySQL database

In [11]:
books.to_sql('Books', engine, if_exists = 'replace')

6

In [12]:
q = """SELECT * FROM Books LIMIT 5;"""
pd.read_sql(q, engine)

   index  id                 title  author_id
0      0   1           The Shining          1
1      1   2                    It          1
2      2   3      The Great Gatsby          2
3      3   4  The Call of the Wild          3
4      4   5   Pride and Prejudice          4

# Favorites table

In [13]:
favorites = pd.read_csv('data/Favorites.csv')
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

## Adding Favorites table to database

In [14]:
favorites.to_sql('Favorites', engine, if_exists = 'replace')

7

In [15]:
q = """SELECT * FROM Favorites LIMIT 5;"""
pd.read_sql(q, engine)

   index  user_id  book_id
0      0        1        1
1      1        1        2
2      2        1        3
3      3        2        4
4      4        2        5

# Show all tables in MySQL database

In [16]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books
0         Authors
1           Books
2       Favorites
3           Users

# List the titles of all of John Doe's favorite books.

In [17]:
q = """SELECT Books.title, Favorites.user_id
FROM Books
JOIN Favorites ON Books.id = Favorites.book_id
WHERE Favorites.user_id = 
(SELECT Users.id FROM Users WHERE (Users.last_name = "Doe" AND Users.first_name = "John"));"""

pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1

# Note: Books SQL file added to Data folder in repository!